Autodesk.Revit.DB.LoadOperationType
An enum indicating whether a resource load operation was triggered by
a user action or an automatic process.
Remarks:
This enum is provided so that an external resource server can
decide how much feedback it wishes to provide to the user.
For example, Revit automatically loads all resources on file open.
This may cause many external resources to load at once. The server
may wish to provide truncated error messages.
Reload() and LoadFrom() operations from the API are considered to
be LoadOperationType.Explicit.

Autodesk.Revit.DB.LoadOperationType.Explicit
The load operation was triggered by an explicit reload action on the part
of the user.

Autodesk.Revit.DB.LoadOperationType.Automatic
The load operation was triggered automatically by another operation.